//
//  Data.swift
//  OhMyGosh
//
//  Created by john john on 2017/9/1.
//  Copyright © 2017年 John. All rights reserved.
//

import UIKit

let wealthy = ["財富回收期，先前辛勤的耕耘到了今日是開花結果的時刻！當然，回收的多寡與先前的耕耘有關係。","想賺錢就需要費點口才，而花錢卻能換得快樂，不妨趁今日輕輕鬆鬆的犒賞自己，大方的花錢來享受一番！","收入上較平穩，沒有多餘的財路也較少因為應酬而損財。","凡事以平常心對待，別被金錢所困擾。","財氣不穩定，宜進不宜出。投資判斷上要謹慎，最好按兵不動，注意莽撞之下做出衝動的決定。","暗財運偏弱，想要暗中獲得支援或暗中有額外進財渠道似乎不容易。","可能會有強烈花錢的慾望，注意控制！"]
let love = ["異性緣還不錯，在外活動容易受到異性的青睞。","佔有慾較強，想要控制另一半，與其刻意去把握，不如給對方充分的空間，彼此信任。","渴望戀愛的氣氛，可是太挑剔會招致反效果。","戀愛運普通，戀愛中人在今天去約會吧，無論是看電影或聽音樂會都行，想辦法湊在一起就對囉！","桃花盛開，會有許多異性主動接近你，想戀愛的話就找機會與異性互動吧。","單身者對異性出手大方，常有異性圍著你轉；有伴侶的人溝通較少，易引起誤會。","單身者多到熱鬧的場所，可增加桃花運；已婚者多安排與另一半約會，增加甜蜜度。"]
let life = ["不錯，推動運作上得心應手，可是應注意謙虛，不宜躁進，以免落人口舌。","很想在朋友、同事面前表現一番，卻很容易就扮演了濫好人的角色。","行動力十足，有利於新計劃的執行，如果能放開心胸接受不同意見，成功的機會更大。","普通，不過還是能得到他人的協助。","學習和工作方面容易陷入困境，應調整好心態，休息好了才能更理性做出判斷。","吃喝玩樂的機會多，讓你無法集中精力工作。在做事時收起玩樂心，細心一些才好。","面臨抉擇時特別容易彰顯優柔寡斷的一面，而且很怕壓力加上太敏感，心情上恐有忐忑不安的感覺。"]
let all = ["公司會將重大任務交給你，你能夠手到擒來，上級必會對你刮目相看。戀愛運持續走高，搭配最流行服飾，主動邀約，成功機率高。好事當然需要與人分享，邀請朋友晚上在家開個Party來慶祝吧！","工作中與同事有點小摩擦，但也不要大動肝火，包容一些小事能更好地維持和諧的人際關係。財運尚可，但是粗心大意的習慣不加約制，就會讓財神爺逃之夭夭。已婚者與伴侶之間多進行互動有助瞭解雙方的思想動態。","愛情來得快去得也快，勉強來的愛情並不如預期的甜美，放棄才易拾獲真正的幸福。今天的財運高低完全取決於你的情緒，切忌太過急躁。工作上責任心極強，渴望得到他人認可的心態讓你幹勁十足。","即使是胸襟開闊的伴侶，也禁不起你的惡劣脾氣，心裡有怨氣可別隨便對另一半發洩哦！作息不規律，難以達到最佳的工作、學習狀態。平日喜歡與人分享者，今天可望分享他人的勝利大餐。","今天與情人相處的時間不多，但並不會淡化你們的感情；錢財流失較快，大部分的開銷會用在家人的身上；前期提出的方案，今天會稍有眉目，讓你對工作信心倍增。","今天有機會和戀人一起看電影，加深彼此的依戀。工作風平浪靜，能順利接到新業務，增加一筆額外收入。抓住與人互動的機會，易結識貴人，對你將來的學習和事業都有很大的幫助。","容易犯粗心的毛病，對於文字、數據的處理應特別小心。向朋友傾訴工作中的不愉快，會得到他們的安慰與鼓勵，讓你自信不少。愛情發展順利，你小小的付出都會讓對方得到滿足。"]

class Data: NSObject {

}
